[{"cat":"library","name":"D3","value":30,"icon":"img/d3.svg","desc":"\n    D3.js (or just D3 for Data-Driven Documents) is a JavaScript library for\n        producing dynamic, interactive data visualizations in web browsers.\n        It makes use of the widely implemented SVG, HTML5, and CSS standards.<br>\n    This infographic you are viewing is made with D3.\n        "},{"cat":"library","name":"Raphaël","value":10,"icon":"img/raphael.svg","desc":"\n    Raphaël is a cross-browser JavaScript library that draws Vector graphics for web sites.\n            It will use SVG for most browsers, but will use VML for older versions of Internet Explorer.\n                "},{"cat":"library","name":"Relay","value":70,"icon":"img/relay.svg","desc":"\n    A JavaScript framework for building data-driven React applications.\n            It uses GraphQL as the query language to exchange data between app and server efficiently.\n                Queries live next to the views that rely on them, so you can easily reason\n        about your app. Relay aggregates queries into efficient network requests to fetch only what you need.\n        "},{"cat":"library","name":"Three.js","value":40,"icon":"img/threejs.png","desc":"\n    Three.js allows the creation of GPU-accelerated 3D animations using\n    the JavaScript language as part of a website without relying on\n    proprietary browser plugins. This is possible thanks to the advent of WebGL.\n        "},{"cat":"library sub","name":"Lodash","value":30,"icon":"img/lodash.svg","desc":"\n    Lodash is a JavaScript library which provides <strong>utility functions</strong> for\n        common programming tasks using the functional programming paradigm."},{"cat":"library sub","name":"Moment JS","value":30,"icon":"img/momentjs.png","desc":"\n    Handy and resourceful JavaScript library to parse, validate, manipulate, and display dates and times.\n        "},{"cat":"library sub","name":"Numeral.js","value":20,"icon":"Numeral.js","desc":"\n    A javascript library for formatting and manipulating numbers.\n            "},{"cat":"library sub","name":"Redux","value":80,"icon":"img/redux.svg","desc":"\n    Redux is an open-source JavaScript library designed for managing\n        application state. It is primarily used together with React for building user interfaces.\n                Redux is inspired by Facebook’s Flux and influenced by functional programming language Elm.\n                    "},{"cat":"framework","name":"Angular 2.0","value":30,"icon":"img/angular2.svg","desc":"\n    Angular (commonly referred to as \"Angular 2+\" or \"Angular 2\") is a TypeScript-based\n    open-source front-end web application platform led by the Angular Team at Google and\n    by a community of individuals and corporations to address all of the parts of the\n    developer\"s workflow while building complex web applications.\n        "},{"cat":"framework","name":"Bootstrap CSS","value":50,"icon":"img/bootstrap.svg","desc":"\n    Bootstrap is a free and open-source front-end web framework for designing websites\n        and web applications. It contains HTML-and CSS-based design templates for typography,\n            forms, buttons, navigation and other interface components, as well as optional JavaScript extensions.\n        "},{"cat":"framework","name":"Ember JS","value":10,"icon":"img/ember.png","desc":"\n    Ember.js is an open-source JavaScript web framework, based on the Model–view–viewmodel\n    (MVVM) pattern. It allows developers to create scalable single-page web applications by\n    incorporating common idioms and best practices into the framework.\n        "},{"cat":"framework","name":"ExpressJS","value":30,"icon":"img/expressjs.png","desc":"\n    Express.js, or simply Express, is a JavaScript framework designed for building web applications and APIs.\n            It is the de facto server framework for Node.js.\n                "},{"cat":"framework","name":"Hexo","value":50,"icon":"img/hexo.png","desc":"\n         A fast, simple & powerful blog-aware <strong>static website</strong> generator, powered by Node.js.\n         "},{"cat":"framework","name":"ReactJS","value":100,"icon":"img/react.png","desc":"\n         React (sometimes written React.js or ReactJS) is an open-source JavaScript framework maintained by Facebook for building user interfaces.\n         React processes only user interface in applications and can be used in combination with other JavaScript libraries\n         or frameworks such as Redux, Flux, Backbone...\n         "},{"cat":"tooling","name":"Atom","value":10,"icon":"img/atom.png","desc":"\n         Atom is a free and open-source text and source code editor for macOS, Linux, and Windows with support\n             for plug-ins written in Node.js, and embedded Git Control, developed by GitHub.\n                     Atom is a desktop application built using web technologies.\n                         "},{"cat":"tooling","name":"Google Chrome & Devtool","value":70,"icon":"img/chrome-devtools.svg","desc":"\n    <strong>Web development tools (devtool)</strong> allow web developers to test and debug their code.\n        At Nau, we use the one come with Google Chrome to debug our apps. It is one the the most powerful\n    and sophisticated devtool available.\n        "},{"cat":"tooling","name":"Jenkins CI","value":30,"icon":"img/jenkins.png","desc":"\n    Jenkins is an open source automation server. Jenkins helps to automate the non-human part of\n    the whole software development process, with now common things like continuous integration,\n    but by further empowering teams to implement the technical part of a Continuous Delivery.\n        "},{"cat":"tooling","name":"Sublime Text 3","value":100,"icon":"img/sublimetext.png","desc":"\n    Sublime Text 3 is a powerful and cross-platform source code editor. It is well-known for\n        introducing the concept of multi-cursor and lots of text editing command. Besides, its\n    plugin ecosystem is very rich which allows enhancing productivity to the fullest.\n        "},{"cat":"tooling","name":"Visual Studio Code","value":50,"icon":"img/vscode.png","desc":"\n    Visual Studio Code is a cross-platform source code editor developed by Microsoft.\n        It includes support for debugging, embedded Git control, syntax highlighting,\n    intelligent code completion, snippets, and code refactoring. Its extensions eco system is\n    growing quickly and it is becoming the best Front End editors out there.\n        "},{"cat":"tooling","name":"Performance Tooling","value":30,"icon":"Performance;Tooling","desc":"\n    At Nau, web performance is our top priority when development web sites and applications.\n        We\"re practicing code optimization and Front End delivery optimization from day 1.\n        To measure the resuslts, we use several tools to audit and benchmark our applications,\n    including (but not limit to): Chrome devtool timeline & audit, Google PageSpeed Insights, Web Page Test, Website Grader...\n        "},{"cat":"tooling","name":"Yeoman generator for Nau Workflow","value":20,"icon":"img/yeoman.png","desc":"\n    Yeoman is an open source, command-line interface set of tools mainly used to generate\n    structure and scaffolding for new projects, especially in JavaScript and Node.js.\n            At Nau, we have developed a Yeoman generator that help quickly set up new projects aligned with\n        Nau\"s conventions and standards.\n        "},{"cat":"tooling","name":"live-server","value":30,"icon":"live-server","desc":"\n    A Node.js-based developer web server for quickly test apps and web pages with some\n        magic of \"auto-reload\" on the browser.\n        "},{"cat":"tooling","name":"PostCSS","value":30,"icon":"img/postcss.svg","desc":"\n    PostCSS is a software development tool that uses JavaScript-based plugins to automate routine CSS operations.<br>\n    We use PostCSS mainly for auto-vendor-prefixing, but very soon we\"ll use it for NextCSS compilation.\n            "},{"cat":"backend","name":"Elastic Search","value":10,"icon":"Elastic;Search","desc":"\n    A specialized database software for high performance search queries.\n            "},{"cat":"backend","name":"Keystone CMS","value":50,"icon":"img/keystonejs.png","desc":"\n    The de-facto CMS system for website built with Node.js. It can be compared with\n        Wordpress of PHP language.\n        "},{"cat":"backend","name":"KoaJS","value":10,"icon":"img/koajs.png","desc":"\n    The advanced and improved version of ExpressJS, with leaner middlewares architecture\n    thanks to the avent of ES6 generators.\n        "},{"cat":"backend","name":"Loopback","value":30,"icon":"img/loopback.svg","desc":"\n    Powerful API-focused web framework built for Node.js. It feature easy to use configurations\n        and auto API documentation page.\n        "},{"cat":"backend","name":"Restify","value":20,"icon":"img/restify.png","desc":"\n    High performance API development framework, built for Node.js. It has some convenient wrapper\n        to automatically generate admin backoffice site and API documentation page.\n        "},{"cat":"backend","name":"MongoDB","value":70,"icon":"img/mongodb.png","desc":"\n    The de-facto Database solution for JavaScript and Node.js applications. It is a light weight,\n        high performance NoSQL database and can be used for small and large websites.\n                "},{"cat":"backend","name":"NodeJS","value":100,"icon":"img/nodejs.svg","desc":"\n    Node.js is a cross-platform JavaScript runtime environment.\n        Node.js allows creation of high performance and high concurrency websites with smaller footprint compared to\n    other server-side solution. Node.js ecosystem is growing very fast and is trusted by a lot of big companies who\n    are adopting it to enhance current products as well as for new ones.\n            "},{"cat":"platform","name":"Docker Platform","value":10,"icon":"img/docker.svg","desc":"\n    Docker is an open-source project that automates the deployment of applications inside software containers.\n        At Nau, we\"re still learning this technology to later facilitate easy web app deployments.\n        "},{"cat":"platform","name":"MeteorJS","value":80,"icon":"img/meteor.svg","desc":"\n    MeteorJS is a free and open-source JavaScript web framework written using Node.js.\n        Meteor allows for rapid prototyping and produces cross-platform (Android, iOS, Web) code.\n        It integrates with MongoDB and uses the Distributed Data Protocol and a publish–subscribe\n    pattern to automatically propagate data changes to clients without requiring the developer\n    to write any synchronization code.\n        "},{"cat":"platform","name":"Phonegap","value":50,"icon":"img/phonegap.png","desc":"\n    A platform, library and tool for building hybrid mobile app.\n            "},{"cat":"platform","name":"Reaction Commerce","value":20,"icon":"img/reactioncommerce.png","desc":"\n    Reaction Commerce is the first open source, real-time platform to\n    combine the flexibility developers and designers want with the stability\n    and support businesses need. ReactionCommerce is based on MeteorJS platform.\n        "},{"cat":"platform","name":"ReactNative","value":10,"icon":"img/reactnative.png","desc":"\n    React Native lets you build mobile apps using only JavaScript.\n        It uses the same design as React, letting us compose a rich\n    mobile UI from declarative components.\n        "},{"cat":"platform","name":"SquareSpace","value":30,"icon":"img/squarespace.svg","desc":"\n    Squarespace is a SaaS-based content management system-integrated ecommerce-aware website builder and blogging platform.\n        At Nau, we have built a website for Squarespace using their low-level API which allowed fully customization\n    of the interface and other Front End functionalities.\n        "},{"cat":"language","name":"HTML5 & CSS3","value":100,"icon":"img/html5-css3.png","desc":"\n    The languages of the Web Front End. At Nau, they are in our blood and with them we can build\n    world-class websites with any kind of visual effects or designs requested.\n        "},{"cat":"language","name":"JavaScript","value":100,"icon":"img/javascript.png","desc":"\n    JavaScript is the heart of modern Web front end development and essential element of any Single Page\n    Applications. In Nau, we invest a good deal in training developers to have good control of this universal language\n    and now caplable of developing full stack websites with only JavaScript.\n        "},{"cat":"language","name":"CSS Next","value":10,"icon":"img/cssnext.png","desc":"\n    The CSS language specs of the future but with the help of PostCSS (like Babel for ES6),\n        we can use CSS Next today.\n        "},{"cat":"language","name":"GraphQL","value":50,"icon":"img/graphql.svg","desc":"\n    GraphQL is a data query language developed by Facebook publicly released in 2015.\n        It provides an alternative to REST and ad-hoc webservice architectures. In combination\n    with RelayJS, this combo help us reduce the time to develop web apps for weeks.\n            "},{"cat":"language","name":"LESS CSS","value":20,"icon":"img/less.svg","desc":"\n    A preprocessor language to be compiled to CSS. This language is not as popular nowadays and we\n    only use them when requested.\n        "},{"cat":"language","name":"SASS (SCSS flavor)","value":70,"icon":"img/sass.png","desc":"\n    This is our main CSS preprocessor language helping us lay structured foundation to CSS as well\n    as assisting on writing more convenient BEM anotations.\n        "},{"cat":"language","name":"TypeScript 2","value":30,"icon":"img/typescript.png","desc":"\n    The strict-typing flavor of ECMAScript, always requires a compiler to compile to vanilla JavaScript\n    but the type checking and other syntactical sugar are exceptional. Right now, we only use it for\n        Angular 2 projects when needed.\n        "},{"cat":"workflow","name":"code.naustud.io","value":100,"icon":"img/naustudio.svg","desc":"\n    A set of guidelines, presets, configs and stadard documentation for Nau developers.\n            Please visit the document site at: <a href=\"http://code.naustud.io\" target=\"_blank\">code.naustud.io</a>\n        "},{"cat":"workflow","name":"Mobile First","value":100,"icon":"Mobile First","desc":"\n    This is one of our most important principle for web and mobile development.\n            More details will be discussed in blog later.\n                "},{"cat":"workflow","name":"BabelJS","value":50,"icon":"img/babel.png","desc":"\n    The de-facto tool to work with ECMAScript 6 and ReactJS nowadays.\n        "},{"cat":"workflow","name":"CSS BEM Notation","value":70,"icon":"CSS BEM Notation","desc":"\n    Our naming standard for CSS, which enhance collaboration, documentation and reusability of\n        CSS rules.\n        "},{"cat":"workflow","name":"Front End Code Guide","value":30,"icon":"Front End;Code Guide","desc":"\n    Based on an existing best practice document for HTML and CSS. We\"re adopting it as our standards\n        and guideline.\n        "},{"cat":"workflow","name":"ESLint","value":20,"icon":"img/eslint.svg","desc":"\n    The tool to check and validate JavaScript code when we develop and prevent potential issues with code.\n        "},{"cat":"workflow","name":"Gitflow Workflow","value":70,"icon":"img/gitflow.png","desc":"\n    Our code version control tool is Git, and Gitflow is one of its workflow standard which\n    ensure good collaboration and avoid conflict-resolving efforts. For more info, visit: code.naustud.io\n        "},{"cat":"workflow","name":"GulpJS","value":50,"icon":"img/gulp.png","desc":"\n    GulpJS is a task automation tools written for Node.js. It is among the most popular\n        Front End and Node project automation tools nowadays\n    "},{"cat":"workflow","name":"Nau Code Styles","value":50,"icon":"Nau Code Styles","desc":"\n    Based on AirBnB\"s well-defined JavaScript code styles. Our derivation has some different standards such as\n    TAB indentation. This code style has an accompanied ESLint config.\n        "},{"cat":"workflow","name":"Stylelint","value":50,"icon":"img/stylelint.svg","desc":"\n    Our on-stop tool to validate both CSS and SCSS with a set of conventions and guidelines from our best practice.\n        "},{"cat":"workflow","name":"SystemJS","value":20,"icon":"SystemJS","desc":"\n    A module loader library that come along Angular 2. Its use is scarce, however.\n        "},{"cat":"workflow","name":"Webpack","value":30,"icon":"img/webpack.svg","desc":"\n    A module bundler library that is becoming de-facto tool to use in ReactJS or SPA apps nowadays.\n        "},{"cat":"legacy","name":"AngularJS 1","value":10,"icon":"img/angular1.png","desc":"\n    Angular 1. Deprecated\n    "},{"cat":"legacy","name":"Backbone","value":30,"icon":"img/backbone.png","desc":"\n    A Model-View library. Deprecated\n    "},{"cat":"legacy","name":"Grunt & Automation Stack","value":30,"icon":"img/grunt.svg","desc":"\n    Grunt task automation tool. Deprecated\n    "},{"cat":"legacy","name":"jQuery","value":50,"icon":"img/jquery.png","desc":"\n    Deprecated, because <a href=\"http://youmightnotneedjquery.com/\" target=\"_blank\">youmightnotneedjquery.com</a>\n    "},{"cat":"legacy","name":"RequireJS & AMD","value":30,"icon":"img/requirejs.svg","desc":"\n    AMD module loader. Deprecated and replaced by ES module and Webpack.\n        "},{"cat":"legacy tooling","name":"Browser Sync","value":40,"icon":"Browser Sync","desc":"\n    Web development server popular among gulp/grunt web apps. No deprecated and replaced by live-server\n    or webpackDevServer.\n        "},{"cat":"legacy tooling","name":"Git Pre-commit","value":30,"icon":"Git;Pre-commit","desc":"\n    Pre-commit hook for git, now deprecated due to slow commit time. Code validation should be done\n        in the code editor.\n        "},{"cat":"legacy tooling","name":"http-server","value":20,"icon":"http-server","desc":"\n    A quick test web server based on Node.js, deprecated and replaced by live-server.\n        "},{"cat":"legacy tooling","name":"LiveReload","value":20,"icon":"Live;Reload","desc":"\n    A propritery auto-reload solution for web developers, now deprecated in favor of live-server and\n        hot module reload in Webpack.\n        "}]
